<details><summary>Show Plan</summary>

```

[command]/home/runner/work/_temp/aad93980-c2aa-47c6-a0c2-ad8cb47ba8f7/terraform-bin -chdir=terraform show -no-color /tmp/plan.tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.ecs.aws_appautoscaling_target.ecs_target will be updated in-place
  ~ resource "aws_appautoscaling_target" "ecs_target" {
        id                 = "service/staging_keyserver_cluster/staging_keyserver-service"
      ~ role_arn           = "arn:aws:iam::898587786287:role/aws-service-role/ecs.application-autoscaling.amazonaws.com/AWSServiceRoleForApplicationAutoScaling_ECSService" -> "arn:aws:iam::898587786287:role/staging_keyserver-ecs-scale-application"
        # (5 unchanged attributes hidden)
    }

  # module.ecs.aws_ecs_service.app_service will be updated in-place
  ~ resource "aws_ecs_service" "app_service" {
        id                                 = "arn:aws:ecs:eu-central-1:898587786287:service/staging_keyserver_cluster/staging_keyserver-service"
        name                               = "staging_keyserver-service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging_keyserver:61" -> (known after apply)
        # (14 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ecs.aws_ecs_task_definition.app_task must be replaced
-/+ resource "aws_ecs_task_definition" "app_task" {
      ~ arn                      = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging_keyserver:61" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ id                       = "staging_keyserver" -> (known after apply)
      ~ revision                 = 61 -> (known after apply)
      - tags                     = {} -> null
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.o11y.data.jsonnet_file.dashboard will be read during apply
  # (config refers to values not yet known)
 <= data "jsonnet_file" "dashboard" {
      + ext_str  = {
          + "cloudwatch_uid"   = (known after apply)
          + "dashboard_title"  = "staging - keyserver"
          + "dashboard_uid"    = "staging-keyserver"
          + "docdb_cluster_id" = "staging-keyserver-keystore-docdb-primary-cluster"
          + "ecs_service_name" = "staging_keyserver-service"
          + "environment"      = "staging"
          + "load_balancer"    = "net/staging-keyserver-lb-2eb/0d99c3df9acef115"
          + "notifications"    = jsonencode([])
          + "prometheus_uid"   = (known after apply)
          + "target_group"     = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:targetgroup/staging-keyserver-f98/9f1f9120ecebaac4"
        }
      + id       = (known after apply)
      + rendered = (known after apply)
      + source   = "monitoring/dashboard.jsonnet"
    }

  # module.o11y.grafana_dashboard.main will be created
  + resource "grafana_dashboard" "main" {
      + config_json  = (known after apply)
      + dashboard_id = (known after apply)
      + id           = (known after apply)
      + message      = "Updated by Terraform"
      + overwrite    = true
      + slug         = (known after apply)
      + uid          = (known after apply)
      + url          = (known after apply)
      + version      = (known after apply)
    }

  # module.o11y.grafana_data_source.cloudwatch will be created
  + resource "grafana_data_source" "cloudwatch" {
      + access_mode        = "proxy"
      + basic_auth_enabled = false
      + id                 = (known after apply)
      + is_default         = false
      + json_data_encoded  = jsonencode(
            {
              + defaultRegion = "eu-central-1"
            }
        )
      + name               = "staging-keyserver-cloudwatch"
      + type               = "cloudwatch"
      + uid                = (known after apply)
    }

  # module.o11y.grafana_data_source.prometheus will be created
  + resource "grafana_data_source" "prometheus" {
      + access_mode        = "proxy"
      + basic_auth_enabled = false
      + id                 = (known after apply)
      + is_default         = false
      + json_data_encoded  = jsonencode(
            {
              + httpMethod    = "GET"
              + sigV4Auth     = true
              + sigV4AuthType = "workspace-iam-role"
              + sigV4Region   = "eu-central-1"
            }
        )
      + name               = "staging-keyserver-amp"
      + type               = "prometheus"
      + uid                = (known after apply)
      + url                = "https://aps-workspaces.eu-central-1.amazonaws.com/workspaces/ws-553c9884-8a2f-47e2-bb2a-33ad5a11e98e/"
    }

Plan: 4 to add, 2 to change, 1 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A-/+ destroy and then create replacement%0A <= read (data resources)%0A%0ATerraform will perform the following actions:%0A%0A  # module.ecs.aws_appautoscaling_target.ecs_target will be updated in-place%0A  ~ resource "aws_appautoscaling_target" "ecs_target" {%0A        id                 = "service/staging_keyserver_cluster/staging_keyserver-service"%0A      ~ role_arn           = "arn:aws:iam::898587786287:role/aws-service-role/ecs.application-autoscaling.amazonaws.com/AWSServiceRoleForApplicationAutoScaling_ECSService" -> "arn:aws:iam::898587786287:role/staging_keyserver-ecs-scale-application"%0A        # (5 unchanged attributes hidden)%0A    }%0A%0A  # module.ecs.aws_ecs_service.app_service will be updated in-place%0A  ~ resource "aws_ecs_service" "app_service" {%0A        id                                 = "arn:aws:ecs:eu-central-1:898587786287:service/staging_keyserver_cluster/staging_keyserver-service"%0A        name                               = "staging_keyserver-service"%0A        tags                               = {}%0A      ~ task_definition                    = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging_keyserver:61" -> (known after apply)%0A        # (14 unchanged attributes hidden)%0A%0A        # (4 unchanged blocks hidden)%0A    }%0A%0A  # module.ecs.aws_ecs_task_definition.app_task must be replaced%0A-/+ resource "aws_ecs_task_definition" "app_task" {%0A      ~ arn                      = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging_keyserver:61" -> (known after apply)%0A      ~ container_definitions    = (sensitive value) # forces replacement%0A      ~ id                       = "staging_keyserver" -> (known after apply)%0A      ~ revision                 = 61 -> (known after apply)%0A      - tags                     = {} -> null%0A        # (9 unchanged attributes hidden)%0A%0A        # (1 unchanged block hidden)%0A    }%0A%0A  # module.o11y.data.jsonnet_file.dashboard will be read during apply%0A  # (config refers to values not yet known)%0A <= data "jsonnet_file" "dashboard" {%0A      + ext_str  = {%0A          + "cloudwatch_uid"   = (known after apply)%0A          + "dashboard_title"  = "staging - keyserver"%0A          + "dashboard_uid"    = "staging-keyserver"%0A          + "docdb_cluster_id" = "staging-keyserver-keystore-docdb-primary-cluster"%0A          + "ecs_service_name" = "staging_keyserver-service"%0A          + "environment"      = "staging"%0A          + "load_balancer"    = "net/staging-keyserver-lb-2eb/0d99c3df9acef115"%0A          + "notifications"    = jsonencode([])%0A          + "prometheus_uid"   = (known after apply)%0A          + "target_group"     = "arn:aws:elasticloadbalancing:eu-central-1:898587786287:targetgroup/staging-keyserver-f98/9f1f9120ecebaac4"%0A        }%0A      + id       = (known after apply)%0A      + rendered = (known after apply)%0A      + source   = "monitoring/dashboard.jsonnet"%0A    }%0A%0A  # module.o11y.grafana_dashboard.main will be created%0A  + resource "grafana_dashboard" "main" {%0A      + config_json  = (known after apply)%0A      + dashboard_id = (known after apply)%0A      + id           = (known after apply)%0A      + message      = "Updated by Terraform"%0A      + overwrite    = true%0A      + slug         = (known after apply)%0A      + uid          = (known after apply)%0A      + url          = (known after apply)%0A      + version      = (known after apply)%0A    }%0A%0A  # module.o11y.grafana_data_source.cloudwatch will be created%0A  + resource "grafana_data_source" "cloudwatch" {%0A      + access_mode        = "proxy"%0A      + basic_auth_enabled = false%0A      + id                 = (known after apply)%0A      + is_default         = false%0A      + json_data_encoded  = jsonencode(%0A            {%0A              + defaultRegion = "eu-central-1"%0A            }%0A        )%0A      + name               = "staging-keyserver-cloudwatch"%0A      + type               = "cloudwatch"%0A      + uid                = (known after apply)%0A    }%0A%0A  # module.o11y.grafana_data_source.prometheus will be created%0A  + resource "grafana_data_source" "prometheus" {%0A      + access_mode        = "proxy"%0A      + basic_auth_enabled = false%0A      + id                 = (known after apply)%0A      + is_default         = false%0A      + json_data_encoded  = jsonencode(%0A            {%0A              + httpMethod    = "GET"%0A              + sigV4Auth     = true%0A              + sigV4AuthType = "workspace-iam-role"%0A              + sigV4Region   = "eu-central-1"%0A            }%0A        )%0A      + name               = "staging-keyserver-amp"%0A      + type               = "prometheus"%0A      + uid                = (known after apply)%0A      + url                = "https://aps-workspaces.eu-central-1.amazonaws.com/workspaces/ws-553c9884-8a2f-47e2-bb2a-33ad5a11e98e/"%0A    }%0A%0APlan: 4 to add, 2 to change, 1 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0

```

</details>

*Action: `pull_request`*